garyPenhook/PyAvrOCD/svd/avr64db64.svd
        <register>
          <name>OP1RESMUX</name>
          <description>Op Amp 1 Resistor Ladder Multiplexer</description>
          <addressOffset>0x1A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUXTOP</name>
              <description>Multiplexer Top</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Multiplexer off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <description>OPn output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD</name>
                  <description>VDD</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUXBOT</name>
              <description>Multiplexer Bottom</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Multiplexer off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INP</name>
                  <description>Positive input pin for OPn</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INN</name>
                  <description>Negative input pin for OPn</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC</name>
                  <description>DAC output</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINKOUT</name>
                  <description>Link OP[n-1] output</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUXWIP</name>
              <description>Multiplexer Wiper selector</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIP0</name>
                  <description>R1 = 15R, R2 = 1R, R2/R1 = 0.07</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIP1</name>
                  <description>R1 = 14R, R2 = 2R, R2/R1 = 0.14</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIP2</name>
                  <description>R1 = 12R, R2 = 4R, R2/R1 = 0.33</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIP3</name>
                  <description>R1 = 8R, R2 = 8R, R2/R1 = 1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIP4</name>
                  <description>R1 = 6R, R2 = 10R, R2/R1 = 1.67</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIP5</name>
                  <description>R1 = 4R, R2 = 12R, R2/R1 = 3</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIP6</name>
                  <description>R1 = 2R, R2 = 14R, R2/R1 = 7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIP7</name>
                  <description>R1 = 1R, R2 = 15R, R2/R1 = 15</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OP1SETTLE</name>
          <description>Op Amp 1 Settle</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SETTLE</name>
              <description>Settle Time</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OP1STATUS</name>
          <description>Op Amp 1 Status</description>
          <addressOffset>0x19</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SETTLED</name>
              <description>Settled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OP2CAL</name>
          <description>Op Amp 2 Calibration</description>
          <addressOffset>0x25</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CAL</name>
              <description>Calibration (for input offset voltage)</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OP2CTRLA</name>
          <description>Op Amp 2 Control A</description>
          <addressOffset>0x20</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ALWAYSON</name>
              <description>Always On</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EVENTEN</name>
              <description>Enable Events</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTMODE</name>
              <description>Output Mode</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Output Driver Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Output Driver in Normal Mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUNSTBY</name>
              <description>Run in Standby Mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OP2INMUX</name>
          <description>Op Amp 2 Input Multiplexer</description>
          <addressOffset>0x23</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUXPOS</name>
              <description>Positive Input Multiplexer</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INP</name>
                  <description>Positive input pin for OPn</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIP</name>
                  <description>Wiper from OPn's resistor ladder</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC</name>
                  <description>DAC output</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDDIV2</name>
                  <description>VDD/2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINKOUT</name>
                  <description>Output from OP1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINKWIP</name>
                  <description>Wiper from OP0's resistor ladder</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUXNEG</name>
              <description>Negative Input Multiplexer</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INN</name>
                  <description>Negative input pin for OPn</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIP</name>
                  <description>Wiper from OPn's resistor ladder</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <description>OPn output (unity gain)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC</name>
                  <description>DAC output</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OP2RESMUX</name>
          <description>Op Amp 2 Resistor Ladder Multiplexer</description>
          <addressOffset>0x22</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUXTOP</name>
              <description>Multiplexer Top</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Multiplexer off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <description>OPn output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD</name>
                  <description>VDD</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUXBOT</name>
              <description>Multiplexer Bottom</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Multiplexer off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INP</name>
                  <description>Positive input pin for OPn</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INN</name>
                  <description>Negative input pin for OPn</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC</name>
                  <description>DAC output</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINKOUT</name>
                  <description>Link OP[n-1] output</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUXWIP</name>
              <description>Multiplexer Wiper selector</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIP0</name>
                  <description>R1 = 15R, R2 = 1R, R2/R1 = 0.07</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIP1</name>
                  <description>R1 = 14R, R2 = 2R, R2/R1 = 0.14</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIP2</name>
                  <description>R1 = 12R, R2 = 4R, R2/R1 = 0.33</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIP3</name>
                  <description>R1 = 8R, R2 = 8R, R2/R1 = 1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIP4</name>
                  <description>R1 = 6R, R2 = 10R, R2/R1 = 1.67</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIP5</name>
                  <description>R1 = 4R, R2 = 12R, R2/R1 = 3</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIP6</name>
                  <description>R1 = 2R, R2 = 14R, R2/R1 = 7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIP7</name>
                  <description>R1 = 1R, R2 = 15R, R2/R1 = 15</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OP2SETTLE</name>
          <description>Op Amp 2 Settle</description>
          <addressOffset>0x24</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SETTLE</name>
              <description>Settle Time</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OP2STATUS</name>
          <description>Op Amp 2 Status</description>
          <addressOffset>0x21</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SETTLED</name>
              <description>Settled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRCTRL</name>
          <description>Power Control</description>
          <addressOffset>0xF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IRSEL</name>
              <description>Input Range Select</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Full Input Range</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REDUCED</name>
                  <description>Reduced Input Range</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEBASE</name>
          <description>Timebase Value</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIMEBASE</name>
              <description>Timebase Value</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
